//---------------------------------------------------------------------------

#ifndef DefsH
#define DefsH
//---------------------------------------------------------------------------
// Application Definitions
//

#define __ALT__ 4
// 1. Детерминиран избор - първо се проверява chanP1Q
// 2. Детерминиран избор - първо се проверява chanP2Q
// 3. Недетерминиран избор - отворен вариант
// 4. Недетерминиран избор - затворен вариант

typedef struct
{
  int id;				// task id
  int intCounter;		// counter
} TASK_MSG;				// СТРУКТУРИРАНО СЪОБЩЕНИЕ //////////////////////////
//---------------------------------------------------------------------------
#endif
